01 inRecord. 
   02 CEDITIS-PRINT PIC 9.
DATA DIVISION.
WORKING STORAGE SECTION.
  01 GRADE-POINT PIC 9.
  01 QUALITY-POINTS PIC 99.
  01 SEMESTER-CREDITS PIC 99V99 VALUE 02.25.
  01 SEMESTER-GPA PIC 9V99.
  01 CUMULATIVEGPA PIC 9V99 VALUE 3.44.
  01 SEMESTER-QUALITY-POINTS PIC 99.
  01 CUMULATIVE-QUALITY-POINTS PIC 999.
  01 CUMULATIVE CREDITS PIC 99.

PROCEDURE DIVISION.
*> QUALITY POINTS
IF GRADE-PRINT IS EQUAL "A"
     MOVE 4 TO GRADE-POINT
ELSE IF GRADE-PRINT IS EQUAL "B"
     MOVE 3 TO GRADE-POINT
ELSE IF GRADE-PRINT IS EQUAL "C"
     MOVE 2 TO GRADE-POINT
ELSE 
     MOVE 1 TO GRADE-POINT
END-IF.

COMPUTE QUALITY-POINTS = GRADE-POINT * CREDITS-PRINT.

*> SEMESTER CREDITS
COMPUTE SEMESTER-CREITS = SEMESTER-TOTAL + CREDITS-POINT.

*> TOTAL CREDITS
COMPUTE CUMULATIVE-CREDITS = CUMULATIVE-CREDITS + SEMESTER-TOTAL.

*> SEMESTER QUALITY POINTS
COMPUTE SEMESTER-QUALITY-POINTS = SEMESTER-QUALITY-POINTS + QUALITY-POINTS.

*> TOTAL QUALITY POINTS
COMPUTE CUMULATIVE-QUALITY-POINTS = CUMULATIVE-QUALITY-POINTS + SEMESTER-QUALITY-POINTS.

*> SEMESTER GPA
COMPUTE SEMESTER-GPA = SEMESTER-QUALITY-POINTS / SEMESTER-CREDITS.

*> CUMULATIVE GPA
COMPUTE CUMULATIVE-GPA = CUMULATIVE-QUALITY-POINTS / CUMULATIVE-CREDITS.

STOP-RUN.
